-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: quotation
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `service`
--

DROP TABLE IF EXISTS `service`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `service` (
  `code` varchar(4) NOT NULL DEFAULT 'SER',
  `id` int(5) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `address` varchar(45) NOT NULL,
  `village` varchar(45) DEFAULT NULL,
  `road` varchar(45) DEFAULT NULL,
  `refprovid` varchar(100) NOT NULL,
  `refdistid` varchar(100) NOT NULL,
  `refsubdistid` varchar(100) NOT NULL,
  `zipcode` int NOT NULL,
  `taxid` varchar(45) DEFAULT '0000000000000',
  `phone` varchar(45) NOT NULL,
  `staff` varchar(150) DEFAULT NULL,
  `branch_id` varchar(6) DEFAULT '00000',
  `branch_th` varchar(45) DEFAULT 'สำนักงานใหญ่',
  `date` date DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `jobsid_1` varchar(255) DEFAULT NULL,
  `jobsid_2` varchar(255) DEFAULT NULL,
  `jobsid_3` varchar(255) DEFAULT NULL,
  `jobsid_4` varchar(255) DEFAULT NULL,
  `details` longtext,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service`
--

LOCK TABLES `service` WRITE;
/*!40000 ALTER TABLE `service` DISABLE KEYS */;
INSERT INTO `service` VALUES ('SER',00001,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567899999','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','test@gmail.com','ซ่อมคอมพิวเตอร์','','',NULL,''),('SER',00002,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567899999','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','test@gmail.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','','',''),('SER',00003,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567899999','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','test@gmail.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','ซ่อมเครื่องสำรองไฟ / เปลี่ยนแบตเตอรี่ / เปิดไม่ติด',NULL,'Internet ใช้งานไม่ได้'),('SER',00004,'สราวุธ เทพนิยม','44/213','ตึกการบินไทย','วิภาวดี12','กรุงเทพมหานคร','เขตบางเขน','อนุสาวรีย์',10220,'','084-134-0924','','','','2023-05-06','tepniyom@gmail.com','ซ่อมจอคอมพิวเตอร์ / เปิดไม่ติด / ติดๆดับ / สีเพี้ยน','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','','',''),('SER',00005,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'5556622211154','084-134-0001','นายทรงพล กลไกล','','','2023-05-06','d-m-d-m-d-m@hotmail.com','ซ่อมเครื่องสำรองไฟ / เปลี่ยนแบตเตอรี่ / เปิดไม่ติด','','','',''),('SER',00006,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567899999','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','tepniyom@gmail.com','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','','',''),('SER',00007,'บริษัท ตัวอย่าง จำกัด','55/22','รามวง','รามคำแหง','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567891234','02-523-52456','ปรมินทร์','','','2023-05-06','ram@ram.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','','',''),('SER',00008,'บริษัท ตัวอย่าง จำกัด','55/22','รามวง','รามคำแหง','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'1234567891234','02-523-52456','ภาคิน','00001','ทองพลับ','2023-05-06','ram@ram.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','','',''),('SER',00009,'มหาวิทยาลัยรามคำแแหง','2564','รามวง','รามคำแหง','กรุงเทพมหานคร','เขตหนองจอก','คลองสิบ',10530,'1234567891234','02-523-52456','ปรมินทร์','','','2023-05-06','ram@ram.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','ซ่อมปริ้นเตอร์ / สั่งพิมพ์ไม่ได้ / เปลี่ยนหัวพิมพ์ / สีเพี้ยน','','',''),('SER',00010,'บริษัท ตัวอย่าง จำกัด','55/22','รามวง','รามคำแหง','อ่างทอง','ไชโย','ชัยฤทธิ์',14140,'1234567897897','02-523-52456','ภาคิน','','','2023-05-06','ram@ram.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','','','',''),('SER',00011,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'987643212365','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','test@gmail.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','','','',''),('SER',00012,'สราวุธ เทพนิยม','44/213','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-06','test@gmail.com','ซ่อมคอมพิวเตอร์ / เครื่องเปิดไม่ติด / มีไฟเข้าแต่ไม่ขึ้นภาพ','','','',''),('SER',00013,'บริษัท ตัวอย่าง จำกัด','44/216','พนาสนธ์การ์เด้นโฮม8','นิมิตใหม่12 / นิมิตใหม่','กรุงเทพมหานคร','เขตคลองสามวา','ทรายกองดิน',10510,'123456789987','084-134-0924','นายสราวุธ เทพนิยม','','','2023-05-07','test@gmail.com','','','','','');
/*!40000 ALTER TABLE `service` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-06 10:57:42
