<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Body</title>
</head>
<body>
    <nav class="nav body">
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            ปัจจุบันการบริษัทส่วนใหญ่มีแนวโน้มการใช้งานเว็บแอปพลิเคชัน มาเป็นตัวช่วยในการลดภาระการทำงานของพนักงานและเพื่อให้เกิดความรวดเร็วในการติดต่อกลุ่มลูกค้า
            ไม่ว่าจะเป็นด้านการขอใบเสนอราคาหรือการแจ้งงาน แจ้งซ่อมอุปกรณ์ ในกลุ่มของบริษัทที่มีงานด้านบริการซึ่งจากที่เราทราบกันดีว่าเว็บ ที่เราใช้งานในปัจจุบันนี้ได้พัฒนา
            อย่างต่อเนื่องสามารถรองรับการใช้งานได้ทั้ง คอมพิวเตอร์ และสมาร์ทโฟน และได้หลายแพล็ตฟอร์ม เมื่อเทียบกับวินโดว์แอปพลิเคชันก่อนหน้านี้ และเพื่อให้การทำงานที่
            สะดวกสบายขึ้น.
        </p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           ที่มาของกรณีศึกษาได้จากการฝึกงานช่วงปิดภาคเรียนที่ 2/64 ทางบริษัทต้นสังกัดที่ผู้ทำโครงการได้เข้าไปฝึกงานและจากการดำเนินการของธุรกิจเป็นธุรกิจในด้านงานบริการ
           และงานขายอุปกรณ์คอมพิวเตอร์และเน็ตเวิร์คระบบมีการออกแบบการรับเรื่องบริการและการขอใบเสนอราคาแบบติดต่อโดยตรงกับผู้เกี่ยวข้องเช่นพนักงานขาย พนักงานแผนก 
           หรือผู้ดูแลระบบ ซึ่งทางผู้บริหารจึงเล็งเห็นว่าอาจเกิดข้อผิดพลาดจากกระบวนการบันทึกข้อมูลและไม่ครบถ้วนเนื่องจากประวัติการดำเนินการเคยมีเหตุการณ์ดังกล่าวเกิดขึ้นมา
           แล้วจากที่ผ่านมาส่งผลกระทบในด้านการให้บริการและการเพิ่มยอดขายให้กับทางองค์กร จึงเป็นที่มาของการจัดทำโครงงานนี้.
        </p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           ปริญญานิพนธ์นี้จึงเป็นที่มาของการพัฒนาโปรแกรมประยุกต์เว็ปแอปพลิเคชัน เพื่อปรับปรุงขั้นตอนกระบวนการทำงานรูปแบบเดิมโดยระบบที่มีการพัฒนาขึ้นมาจะช่วยให้เพิ่มยอด
           ขายจากเสนอราคาที่รวดเร็วจากระบบ การเก็บบันทึกปัญหาและขั้นตอนการดำเนินการแก้ไขที่ตรง	วัตถุประสงค์งานบริการขององค์กรการลดระยะเวลาการจัดทำใบเสนอราคา 
           และข้อผิดพลาดในการกรอกข้อมูลจากพนักงาน โดยจะนำระบบเว็บไซต์ เดิมที่องค์กรมีการใช้งานอยู่มาปรับปรุงให้มีฟังก์ชันการทำงานที่หลากหลายและตอบโจทย์การให้บริการ
           ที่ผู้บริหารคาดหวัง.

        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            ลักษณะการงานบริการที่ระบบได้ทำการออกแบบไว้ ระบบแอฟพลิเคชั่นเป็นรูแบบงานบริการ และงารรับแจ้งซ่อมคอมพิวเตอร์ตามลักษณะอาการที่ผู้แจ้งจะต้องระบุอาการเสียเบื้องต้น
            ให้ผูเกี่ยวข้องทราบ เพื่อประเมินอาการเสียและจัดเตรียมแผมนเพื่อเข้าแก้ไข
        </p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           ขั้นตอนการรับเรื่องแจ้งงานเทื่อทีการสร้างเอการการแจ้งงานบริการหรืองานซ่อมคอมพิวเตอร์ระบบจะบันทึกข้อมูลลงในฐานข้อมูลและเก็บวันเวลาพร้อมทั้งเลขที่เอกสารเอกสารที่ถูกสร้าง
           ขึ้นมานี้จะถูกกำหนดว่าห้ามมีการลบแต่แก้ไขรายละเอียดได้เมื่อผู้ที่ login เข้ามามีสถานะเป็นผู้ใช้งาน ระดับ 'user' แต่ระบบ 'admin' จะสามารถ เพิ่ม ลบ แก้ไขได้ทั้งระบบ.
        </p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
           เมื่อเอกสารที่สร้างขึ้นถึงจุดเสร็จสิ้นกระบวนการตามระบบเช่น ใบเสนอรคามีการอนุมัติ หรือนำไปใช้งาน หรือ ใบแจ้องซ่อมคอมพิวเตอร์เลขที่นั้นๆดำเนินการเสร็จสิ้น ระบบได้กำหนดสถานะเอก
           สารว่า 'Done' เพื่อให้ข้อมูลและเลขที่เอกสารนั้นๆคงอยู่และสามารถนำข้อมูลไปทำการวิเคราะห์รายได้ในระบบอื่นๆต่อไป.

        </p>

    </nav>
   
</body>
</html>